[
    {
        "id"     : "sr1.1",
        "title1" : "SR 1.1",
        "title2" : "Human User Identification and authentication",
        "factor" : "Integrity",
        "fun_req": "IAC",
        "about"  : "The control system shall provide the capability to identify and authenticate all human users. This capability shall enforce such identification and authentication on all interfaces which provide human user access to the control system to support segregation of duties and least privilege in accordance with applicable security policies and procedures."
    },
    {
        "id"     : "sr1.2",
        "title1" : "SR 1.2",
        "title2" : "Software Process and Device Identification and Authentication",
        "factor" : "Availability",
        "fun_req": "IAC",
        "about"  : "The control system shall provide the capability to identify and authenticate all software processes and devices. This capability shall enforce such identification and authentication on all interfaces which provide access to the control system to support least privilege in accordance with applicable security policies and procedures."
    },
    {
        "id"     : "sr1.3",
        "title1" : "SR 1.3",
        "title2" : "Account management",
        "factor" : "Integrity",
        "fun_req": "IAC",
        "about"  : "The control system shall provide the capability to support the management of all accounts by authorized users, including adding, activating, modifying, disabling and removing accounts.."
    },
    {
        "id"     : "sr1.4",
        "title1" : "SR 1.4",
        "title2" : "Identifier Management",
        "factor" : "Integrity",
        "fun_req": "IAC",
        "about"  : "The control system shall provide the capability to support the management of identifiers by user, group, role or control system interface."
    },
    {
        "id"     : "sr1.5",
        "title1" : "SR 1.5",
        "title2" : "Authenticator Management",
        "factor" : "Confidentiality",
        "fun_req": "IAC",
        "about"  : "The control system shall provide the capability to:\n a) initialize authenticator content;\n b) change all default authenticators upon control system installation;\n c) change/refresh all authenticators; and\n d) protect all authenticators from unauthorized disclosure and modification when stored and transmitted."
    },
    {
        "id"     : "sr1.6",
        "title1" : "SR 1.6",
        "title2" : "Wireless Access Management",
        "factor" : "Confidentiality",
        "fun_req": "IAC",
        "about"  : "The control system shall provide the capability to identify and authenticate all users (humans, software processes or devices) engaged in wireless communication."
    },
    {
        "id"     : "sr1.7",
        "title1" : "SR 1.7",
        "title2" : "Strength of Password-Based Authentication",
        "factor" : "Confidentiality",
        "fun_req": "IAC",
        "about"  : "For control systems utilizing password-based authentication, the control system shall provide the capability to enforce configurable password strength based on minimum length and variety of character types."
    },
    {
        "id"     : "sr1.8",
        "title1" : "SR 1.8",
        "title2" : "Public Key Infrastructure (PKI) Certificates",
        "factor" : "Confidentiality",
        "fun_req": "IAC",
        "about"  : "Where PKI is utilized, the control system shall provide the capability to operate a PKI according to commonly accepted best practices or obtain public key certificates from an existing PKI."
    },
    {
        "id"     : "sr1.9",
        "title1" : "SR 1.9",
        "title2" : "Strength of Public Key Authentication",
        "factor" : "Confidentiality",
        "fun_req": "IAC",
        "about"  : "For control systems utilizing public key authentication, the control system shall provide the capability to: a) validate certificates by checking the validity of the signature of a given certificate; b) validate certificates by constructing a certification path to an accepted or in the case of self-signed certificates by deploying leaf certificates to all hosts which communicate with the subject to which the certificate is issued; c) validate certificates by checking a given certificate’s revocation status; d) establish user (human, software process or device) control of the corresponding private key; and e) map the authenticated identity to a user (human, software process or device)"
    },
    {
        "id"     : "sr1.10",
        "title1" : "SR 1.10",
        "title2" : "Authenticator Feedback",
        "factor" : "Integrity",
        "fun_req": "IAC",
        "about"  : "The control system shall provide the capability to obscure feedback of authentication information during the authentication process."
    },
    {
        "id"     : "sr1.11",
        "title1" : "SR 1.11",
        "title2" : "Unsuccessful Login Attempts",
        "factor" : "Integrity",
        "fun_req": "IAC",
        "about"  : "The control system shall provide the capability to enforce a limit of a configurable number of consecutive invalid access attempts by any user (human, software process or device) during a configurable time period. The control system shall provide the capability to deny access for a specified period of time or until unlocked by an administrator when this limit has been exceeded. For system accounts on behalf of which critical services or servers are run, the control system shall provide the capability to disallow interactive logons."
    },
    {
        "id"     : "sr1.12",
        "title1" : "SR 1.12",
        "title2" : "System Use Notification",
        "factor" : "Integrity",
        "fun_req": "IAC",
        "about"  : "The control system shall provide the capability to display a system use notification message before authenticating. The system use notification message shall be configurable by authorized personnel."
    },
    {
        "id"     : "sr1.13",
        "title1" : "SR 1.13",
        "title2" : "Access via Untrusted Networks",
        "factor" : "Integrity",
        "fun_req": "IAC",
        "about"  : "The control system shall provide the capability to monitor and control all methods of access to the control system via untrusted networks. "
    },
    {
        "id"     : "sr2.1",
        "title1" : "SR 2.1",
        "title2" : "Authorization Enforcement",
        "factor" : "Integrity",
        "fun_req": "UC",
        "about"  : "On all interfaces, the control system shall provide the capability to enforce authorizations assigned to all human users for controlling use of the control system to support segregation of duties and least privilege."
    },
    {
        "id"     : "sr2.2",
        "title1" : "SR 2.2",
        "title2" : "Wireless Use Control",
        "factor" : "Confidentiality",
        "fun_req": "UC",
        "about"  : "The control system shall provide the capability to authorize, monitor and enforce usage restrictions for wireless connectivity to the control system according to commonly accepted security industry practices"
    },{
        "id"     : "sr2.3",
        "title1" : "SR 2.3",
        "title2" : "Use Control for portable and Mobile devices",
        "factor" : "Confidentiality",
        "fun_req": "UC",
        "about"  : " The control system shall provide the capability to automatically enforce configurable usage restrictions that include: a) preventing the use of portable and mobile devices; b) requiring context specific authorization; and c) restricting code and data transfer to/from portable and mobile devices ."
    },
    {
        "id"     : "sr2.4",
        "title1" : "SR 2.4",
        "title2" : "Mobile Code",
        "factor" : "Integrity",
        "fun_req": "UC",
        "about"  : "The control system shall provide the capability to enforce usage restrictions for mobile code technologies based on the potential to cause damage to the control system that include: a) preventing the execution of mobile code; b) requiring proper authentication and authorization for origin of the code; c) restricting mobile code transfer to/from the control system; and d) monitoring the use of mobile code"
    },
    {
        "id"     : "sr2.5",
        "title1" : "SR 2.5",
        "title2" : "Session Lock",
        "factor" : "Availability",
        "fun_req": "UC",
        "about"  : "The control system shall provide the capability to prevent  further access by initiating a session lock after a configurable time period of inactivity or by manual initiation. The session lock shall remain in effect until the human user who owns the session or another authorized human user re-establishes access using appropriate identification and authentication procedures."
    },
    {
        "id"     : "sr2.6",
        "title1" : "SR 2.6",
        "title2" : "Remote Session Termination",
        "factor" : "Availability",
        "fun_req": "UC",
        "about"  : "The control system shall provide the capability to terminate a remote session either automatically after a configurable time period of inactivity or manually by the user who initiated the session."
    },
    {
        "id"     : "sr2.7",
        "title1" : "SR 2.7",
        "title2" : "Concurrent Session Control",
        "factor" : "Integrity",
        "fun_req": "UC",
        "about"  : "The control system shall provide the capability to limit the number of concurrent sessions per interface for any given user (human, software process or device) to a configurable number of sessions."
    },
    {
        "id"     : "sr2.8",
        "title1" : "SR 2.8",
        "title2" : "Auditable Events",
        "factor" : "Confidentiality",
        "fun_req": "UC",
        "about"  : " The control system shall provide the capability to generate audit records relevant to security for the following categories: access control, request errors, operating system events, control system events, backup and restore events, configuration changes, potential reconnaissance activity and audit log events. Individual audit records shall include the timestamp, source, category, type, event ID and event result"
    },
    {
        "id"     : "sr2.9",
        "title1" : "SR 2.9",
        "title2" : "Audit Storage Capacity",
        "factor" : "Availability",
        "fun_req": "UC",
        "about"  : " The control system shall allocate sufficient audit record storage capacity according to commonly recognized recommendations for log management and system configuration. The control system shall provide auditing mechanisms to reduce the likelihood of such capacity being exceeded."
    },
    {
        "id"     : "sr2.10",
        "title1" : "SR 2.10",
        "title2" : "Response to Audit Procesing Failures",
        "factor" : "Availability",
        "fun_req": "UC",
        "about"  : "The control system shall provide the capability to alert personnel and prevent the loss of essential services and functions in the event of an audit processing failure. The control system shall provide the capability to support appropriate actions in response to an audit processing failure according to commonly accepted industry practices and recommendations ."
    },
    {
        "id"     : "sr2.11",
        "title1" : "SR 2.11",
        "title2" : "Time Stamps",
        "factor" : "Integrity",
        "fun_req": "UC",
        "about"  : "The control system shall provide timestamps for use in audit record generation"
    },
    {
        "id"     : "sr2.12",
        "title1" : "SR 2.12",
        "title2" : "Non-Repudiation",
        "factor" : "Integrity",
        "fun_req": "UC",
        "about"  : "The control system shall provide the capability to determine whether a given human user took a particular action"
    },
    {
        "id"     : "sr3.1",
        "title1" : "SR 3.1",
        "title2" : "Communication Integrity",
        "factor" : "Integrity",
        "fun_req": "SI",
        "about"  : "The Control system shall provide the capability to protect the integrity of transmitted information."
    },
    {
        "id"     : "sr3.2",
        "title1" : "SR 3.2",
        "title2" : "Malicious Code Protection",
        "factor" : "Integrity",
        "fun_req": "SI",
        "about"  : " The control system shall provide the capability to employ protection mechanisms to prevent, detect, report and mitigate the effects of malicious code or unauthorized software. The control system shall provide the capability to update the protection mechanisms."
    },
    {
        "id"     : "sr3.3",
        "title1" : "SR 3.3",
        "title2" : "Security Functionality Verification",
        "factor" : "Integrity",
        "fun_req": "SI",
        "about"  : " The control system shall provide the capability to support verification of the intended operation of security functions and report when anomalies are discovered during FAT, SAT and scheduled maintenance. These security functions shall include all those necessary to support the security requirements specified in this standard."
    },
    {
        "id"     : "sr3.4",
        "title1" : "SR 3.4",
        "title2" : "Software and Information Integrity",
        "factor" : "Integrity",
        "fun_req": "SI",
        "about"  : " The control system shall provide the capability to detect, record, report and protect against unauthorized changes to software and information at rest."
    },
    {
        "id"     : "sr3.5",
        "title1" : "SR 3.5",
        "title2" : "Input Validation",
        "factor" : "Integrity",
        "fun_req": "SI",
        "about"  : "The control system shall validate the syntax and content of any input which is used as an industrial process control input or input that directly impacts the action of the control system."
    },
    {
        "id"     : "sr3.6",
        "title1" : "SR 3.6",
        "title2" : "Deterministic Output",
        "factor" : "Integrity",
        "fun_req": "SI",
        "about"  : " The control system shall provide the capability to set outputs to a predetermined state if normal operation cannot be maintained as a result of an attack."
    },
    {
        "id"     : "sr3.7",
        "title1" : "SR 3.7",
        "title2" : "Error Handling",
        "factor" : "Integrity",
        "fun_req": "SI",
        "about"  : " The control system shall identify and handle error conditions in a manner such that effective remediation can occur. This shall be done in a manner which does not provide information that could be exploited by adversaries to attack the IACS unless revealing this information is necessary for the timely troubleshooting of problems."
    },
    {
        "id"     : "sr3.8",
        "title1" : "SR 3.8",
        "title2" : "Session Integrity",
        "factor" : "Integrity",
        "fun_req": "SI",
        "about"  : "The control system shall provide the capability to protect the integrity of sessions. The control system shall reject any usage of invalid session IDs."
    },
    {
        "id"     : "sr3.9",
        "title1" : "SR 3.9",
        "title2" : "Protection of Audit Information",
        "factor" : "Integrity",
        "fun_req": "SI",
        "about"  : " The control system shall protect audit information and audit tools (if present) from unauthorized access, modification and deletion."
    },
    {
        "id"     : "sr4.1",
        "title1" : "SR 4.1",
        "title2" : "Information Confidentiality",
        "factor" : "Confidentiality",
        "fun_req": "DC",
        "about"  : " The control system shall provide the capability to protect the confidentiality of information for which explicit read authorization is supported, whether at rest or in transit."
    },
    {
        "id"     : "sr4.2",
        "title1" : "SR 4.2",
        "title2" : "Information Persistance",
        "factor" : "Confidentiality",
        "fun_req": "DC",
        "about"  : " The control system shall provide the capability to purge all information for which explicit read authorization is supported from components to be released from active service and/or decommissioned."
    },
    {
        "id"     : "sr4.3",
        "title1" : "SR 4.3",
        "title2" : "Use of Cryptography",
        "factor" : "Confidentiality",
        "fun_req": "DC",
        "about"  : " If cryptography is required, the control system shall use cryptographic algorithms, key sizes and mechanisms for key establishment and management according to commonly accepted security industry practices and recommendations"
    },
    {
        "id"     : "sr5.1",
        "title1" : "SR 5.1",
        "title2" : "Network Segmentation",
        "factor" : "Availability",
        "fun_req": "RDF",
        "about"  : " The control system shall provide the capability to logically segment control system networks from non-control system networks and to logically segment critical control system networks from other control system networks."
    },
    {
        "id"     : "sr5.2",
        "title1" : "SR 5.2",
        "title2" : "Zone Boundary Protection",
        "factor" : "Availability",
        "fun_req": "RDF",
        "about"  : " The control system shall provide the capability to monitor and control communications at zone boundaries to enforce the compartmentalization defined in the risk -based zones and conduits model."
    },
    {
        "id"     : "sr5.3",
        "title1" : "SR 5.3",
        "title2" : "General Purpose Person-to-Person Communication Restrictions",
        "factor" : "Availability",
        "fun_req": "RDF",
        "about"  : " The control system shall provide the capability to prevent general purpose person -to-person messages from being received from users or systems external to the control system."
    },
    {
        "id"     : "sr5.4",
        "title1" : "SR 5.4",
        "title2" : "Application Partitioning",
        "factor" : "Availability",
        "fun_req": "RDF",
        "about"  : " The control system shall provide the capability to support partitioning of data, applications and services based on criticality to facilitate implementing a zoning model."
    },
    {
        "id"     : "sr6.1",
        "title1" : "SR 6.1",
        "title2" : "Audit Log Accessibility",
        "factor" : "Integrity",
        "fun_req": "TRE",
        "about"  : " The control system shall provide the capability for authorized humans and/or tools to access audit logs on a read-only basis."
    },
    {
        "id"     : "sr6.2",
        "title1" : "SR 6.2",
        "title2" : "Continuous Monitoring",
        "factor" : "Integrity",
        "fun_req": "TRE",
        "about"  : " The control system shall provide the capability to continuously monitor all security mechanism performance using commonly accepted security industry practices and recommendations to detect, characterize and report security breaches in a timely manner."
    },
    {
        "id"     : "sr7.1",
        "title1" : "SR 7.1",
        "title2" : "Denial of Service Protection",
        "factor" : "Availability",
        "fun_req": "RA",
        "about"  : " The control system shall provide the capability to operate in a degraded mode during a DoS event."
    },
    {
        "id"     : "sr7.2",
        "title1" : "SR 7.2",
        "title2" : "Resource Management",
        "factor" : "Availability",
        "fun_req": "RA",
        "about"  : " The control system shall provide the capability to limit the use of resources by security functions to prevent resource exhaustion."
    },
    {
        "id"     : "sr7.3",
        "title1" : "SR 7.3",
        "title2" : "Control System Backup",
        "factor" : "Availability",
        "fun_req": "RA",
        "about"  : "The identity and location of critical files and the ability to conduct backups of user-level and system-level information (including system state information) shall be supported by the control system without affecting normal plant operations."
    },
    {
        "id"     : "sr7.4",
        "title1" : "SR 7.4",
        "title2" : "Control System Recovery and Reconstitution",
        "factor" : "Availability",
        "fun_req": "RA",
        "about"  : "The control system shall provide the capability to recover and reconstitute to a known secure state after a disruption or failure."
    },
    {
        "id"     : "sr7.5",
        "title1" : "SR 7.5",
        "title2" : "Emergency Power",
        "factor" : "Availability",
        "fun_req": "RA",
        "about"  : "The control system shall provide the capability to switch to and from an emergency power supply without affecting the existing security state or a documented degraded mode."
    },
    {
        "id"     : "sr7.6",
        "title1" : "SR 7.6",
        "title2" : "Network and Security Configuration Settings",
        "factor" : "Availability",
        "fun_req": "RA",
        "about"  : "The control system shall provide the capability to be configured according to recommended network and security configurations as described in guidelines provided by the control system supplier. The control system shall provide an interface to the currently deployed network and security configuration settings"
    },
    {
        "id"     : "sr7.7",
        "title1" : "SR 7.7",
        "title2" : "Least Functionality",
        "factor" : "Availability",
        "fun_req": "RA",
        "about"  : "The control system shall provide the capability to specifically prohibit and/or restrict the use of unnecessary functions, ports, protocols and/or services"
    },
    {
        "id"     : "sr7.8",
        "title1" : "SR 7.8",
        "title2" : "Control System Component Inventory",
        "factor" : "Availability",
        "fun_req": "RA",
        "about"  : "The control system shall provide the capability to report the current list of installed components and their associated properties."
    }
]